---
kind: other
id: Methods.T:Autodesk.Revit.DB.CurtainCell
source: html/c918abb0-53dd-53e5-682c-39831dee7131.htm
---
# CurtainCell Methods

Causes the object to release immediately any resources it may be utilizing.